env.LDAP_EXTRA_SCHEMAS fixes it!    Thank you very much!!!

I don't think there is actually a volume in the way.   I verified that the   PVC and PV are both getting fully destroyed as part of the rebuild and still saw  "Using persisted data" on a fresh build.       That complaint goes away, however, if  setting LDAP_EXTRA_SCHEMAS to "cosine,inetorgperson,nis"


```
~/code/k8s/tf/application$ k get ns
NAME              STATUS   AGE
cinc              Active   3d
default           Active   58d
gbpn              Active   7d17h
keycloak          Active   14d
kube-certman      Active   10d
kube-flannel      Active   11d
kube-network      Active   14d
kube-node-lease   Active   58d
kube-openebs      Active   14d
kube-public       Active   58d
kube-registry     Active   7d20h
kube-system       Active   58d
monitoring        Active   11d
openvpn           Active   10d
Mon.19:33  jblack@Jamess-MacBook-Pro [main]

~/code/k8s/tf/application$ k get pv | grep ldap
Mon.19:33  jblack@Jamess-MacBook-Pro [main]

~/code/k8s/tf/application$ k get pvc | grep ldap
Mon.19:33  jblack@Jamess-MacBook-Pro [main]

~/code/k8s/tf/application$ tf apply
[bunch of state refresh you don't care about
Terraform used the selected providers to generate the following execution plan. Resource actions are indicated with the following symbols:
  + create
 <= read (data resources)

Terraform will perform the following actions:

  # module.ldap.data.kubernetes_secret.ldap will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "kubernetes_secret" "ldap" {
      + data      = (sensitive value)
      + id        = (known after apply)
      + immutable = (known after apply)
      + type      = (known after apply)

      + metadata {
          + generation       = (known after apply)
          + name             = "ldap-openldap"
          + namespace        = "ldap"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }
    }

  # module.ldap.data.kubernetes_service.service will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "kubernetes_service" "service" {
      + id     = (known after apply)
      + spec   = (known after apply)
      + status = (known after apply)

      + metadata {
          + generation       = (known after apply)
          + name             = "ldap-openldap"
          + namespace        = "ldap"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }
    }

  # module.ldap.helm_release.release will be created
  + resource "helm_release" "release" {
      + atomic                     = false
      + chart                      = "openldap-stack-ha"
      + cleanup_on_fail            = false
      + create_namespace           = false
      + dependency_update          = false
      + disable_crd_hooks          = false
      + disable_openapi_validation = false
      + disable_webhooks           = false
      + force_update               = false
      + id                         = (known after apply)
      + lint                       = false
      + manifest                   = (known after apply)
      + max_history                = 0
      + metadata                   = (known after apply)
      + name                       = "ldap"
      + namespace                  = "ldap"
      + pass_credentials           = false
      + recreate_pods              = false
      + render_subchart_notes      = true
      + replace                    = false
      + repository                 = "https://jp-gouin.github.io/helm-openldap/"
      + reset_values               = false
      + reuse_values               = false
      + skip_crds                  = false
      + status                     = "deployed"
      + timeout                    = 300
      + values                     = [
          + <<-EOT
                "env":
                  "LDAP_EXTRA_SCHEMAS": "cosine,inetorgperson,nis"
                "global":
                  "adminPassword": "admin1"
                  "configPassword": "admin1"
                  "ldapDomain": "vn.linuxguru.net"
                  "storageClass": "openebs-jiva-csi-default"
                "phpldapadmin":
                  "ingress":
                    "annotations":
                      "cert-manager.io/cluster-issuer": "linuxguru-ca"
                    "enabled": true
                    "hosts":
                    - "ldap.vn.linuxguru.net"
                    "ingressClassName": "private"
                    "path": "/"
                    "tls":
                    - "hosts":
                      - "ldap.vn.linuxguru.net"
                      "secretName": "openldap-cert"
                "replicaCount": 1
                "replication":
                  "enabled": "false"
            EOT,
        ]
      + verify                     = false
      + version                    = "4.0.2"
      + wait                       = true
      + wait_for_jobs              = false
    }

  # module.ldap.kubernetes_namespace.namespace will be created
  + resource "kubernetes_namespace" "namespace" {
      + id = (known after apply)

      + metadata {
          + generation       = (known after apply)
          + name             = "ldap"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }
    }

Plan: 2 to add, 0 to change, 0 to destroy.

Do you want to perform these actions?
  Terraform will perform the actions described above.
  Only 'yes' will be accepted to approve.

  Enter a value: yes

module.ldap.kubernetes_namespace.namespace: Creating...
module.ldap.kubernetes_namespace.namespace: Creation complete after 0s [id=ldap]
module.ldap.helm_release.release: Creating...
module.ldap.helm_release.release: Still creating... [10s elapsed]
module.ldap.helm_release.release: Still creating... [20s elapsed]
module.ldap.helm_release.release: Still creating... [30s elapsed]
module.ldap.helm_release.release: Creation complete after 38s [id=ldap]
module.ldap.data.kubernetes_secret.ldap: Reading...
module.ldap.data.kubernetes_service.service: Reading...
module.ldap.data.kubernetes_service.service: Read complete after 0s
module.ldap.data.kubernetes_secret.ldap: Read complete after 0s

Apply complete! Resources: 2 added, 0 changed, 0 destroyed.

```

```
~/code/k8s/tf/application$ k get pvc -n ldap
NAME          STATUS   VOLUME                                     CAPACITY   ACCESS MODES   STORAGECLASS       AGE
data-ldap-0   Bound    pvc-8a6125ca-3b1a-46a1-9531-82285f9ba0fa   8Gi        RWO            openebs-hostpath   5m21s
Mon.19:39  jblack@Jamess-MacBook-Pro [main]

~/code/k8s/tf/application$ k describe pv pvc-8a6125ca-3b1a-46a1-9531-82285f9ba0fa
Name:              pvc-8a6125ca-3b1a-46a1-9531-82285f9ba0fa
Labels:            openebs.io/cas-type=local-hostpath
Annotations:       pv.kubernetes.io/provisioned-by: openebs.io/local
Finalizers:        [kubernetes.io/pv-protection]
StorageClass:      openebs-hostpath
Status:            Bound
Claim:             ldap/data-ldap-0
Reclaim Policy:    Delete
Access Modes:      RWO
VolumeMode:        Filesystem
Capacity:          8Gi
Node Affinity:
  Required Terms:
    Term 0:        kubernetes.io/hostname in [k8sn2]
Message:
Source:
    Type:  LocalVolume (a persistent volume backed by local storage on a node)
    Path:  /var/openebs/local/pvc-8a6125ca-3b1a-46a1-9531-82285f9ba0fa
Events:    <none>
Mon.19:39  jblack@Jamess-MacBook-Pro [main]

~/code/k8s/tf/application$ ssh k8sn2
Welcome to Ubuntu 22.04.1 LTS (GNU/Linux 5.15.0-57-generic x86_64)

 * Documentation:  https://help.ubuntu.com
 * Management:     https://landscape.canonical.com
 * Support:        https://ubuntu.com/advantage

  System information as of Mon Feb 13 12:39:37 PM UTC 2023

  System load:  0.2041015625       Processes:               267
  Usage of /:   60.0% of 53.21GB   Users logged in:         0
  Memory usage: 18%                IPv4 address for cni0:   10.244.2.1
  Swap usage:   0%                 IPv4 address for enp3s0: 192.168.0.63
  Temperature:  54.0 C

 * Strictly confined Kubernetes makes edge and IoT secure. Learn how MicroK8s
   just raised the bar for easy, resilient and secure K8s cluster deployment.

   https://ubuntu.com/engage/secure-kubernetes-at-the-edge

73 updates can be applied immediately.
To see these additional updates run: apt list --upgradable


*** System restart required ***
Last login: Mon Feb 13 12:37:48 2023 from 192.168.0.51
sudo fjblack@k8sn2:~$ sudo/var/openebs/local/pvc-8a6125ca-3b1a-46a1-9531-82285f9ba0fa -type f -exec ls -al {} \;
-rw------- 1 1001 1001 102400 Feb 13 12:34 /var/openebs/local/pvc-8a6125ca-3b1a-46a1-9531-82285f9ba0fa/data/data.mdb
-rw------- 1 1001 1001 8192 Feb 13 12:34 /var/openebs/local/pvc-8a6125ca-3b1a-46a1-9531-82285f9ba0fa/data/lock.mdb
-rw------- 1 1001 1001 702 Feb 13 12:34 '/var/openebs/local/pvc-8a6125ca-3b1a-46a1-9531-82285f9ba0fa/slapd.d/cn=config.ldif'
-rw------- 1 1001 1001 618 Feb 13 12:34 '/var/openebs/local/pvc-8a6125ca-3b1a-46a1-9531-82285f9ba0fa/slapd.d/cn=config/olcDatabase={1}monitor.ldif'
-rw------- 1 1001 1001 661 Feb 13 12:34 '/var/openebs/local/pvc-8a6125ca-3b1a-46a1-9531-82285f9ba0fa/slapd.d/cn=config/olcDatabase={0}config.ldif'
-rw------- 1 1001 1001 378 Feb 13 12:34 '/var/openebs/local/pvc-8a6125ca-3b1a-46a1-9531-82285f9ba0fa/slapd.d/cn=config/cn=schema.ldif'
-rw------- 1 1001 1001 742 Feb 13 12:34 '/var/openebs/local/pvc-8a6125ca-3b1a-46a1-9531-82285f9ba0fa/slapd.d/cn=config/olcDatabase={2}mdb.ldif'
-rw------- 1 1001 1001 443 Feb 13 12:34 '/var/openebs/local/pvc-8a6125ca-3b1a-46a1-9531-82285f9ba0fa/slapd.d/cn=config/olcDatabase={-1}frontend.ldif'
-rw------- 1 1001 1001 2953 Feb 13 12:34 '/var/openebs/local/pvc-8a6125ca-3b1a-46a1-9531-82285f9ba0fa/slapd.d/cn=config/cn=schema/cn={2}inetorgperson.ldif'
-rw------- 1 1001 1001 6589 Feb 13 12:34 '/var/openebs/local/pvc-8a6125ca-3b1a-46a1-9531-82285f9ba0fa/slapd.d/cn=config/cn=schema/cn={3}nis.ldif'
-rw------- 1 1001 1001 15575 Feb 13 12:34 '/var/openebs/local/pvc-8a6125ca-3b1a-46a1-9531-82285f9ba0fa/slapd.d/cn=config/cn=schema/cn={0}core.ldif'
-rw------- 1 1001 1001 11459 Feb 13 12:34 '/var/openebs/local/pvc-8a6125ca-3b1a-46a1-9531-82285f9ba0fa/slapd.d/cn=config/cn=schema/cn={1}cosine.ldif'
jblack@k8sn2:~$ date
Mon Feb 13 12:40:06 PM UTC 2023
```

```
~/code/k8s/tf/application$ k logs ldap-0 -n ldap | egrep -v " (closed|ACCEPT) "
Defaulted container "openldap-stack-ha" out of: openldap-stack-ha, init-chmod-secret (init)
 12:34:12.11 INFO  ==> ** Starting LDAP setup **
 12:34:12.18 INFO  ==> Validating settings in LDAP_* env vars
 12:34:12.19 INFO  ==> Initializing OpenLDAP...
 12:34:12.20 DEBUG ==> Ensuring expected directories/files exist...
 12:34:12.23 INFO  ==> Creating LDAP online configuration
 12:34:12.28 INFO  ==> Starting OpenLDAP server in background
63ea2e44.11c80eae 0x7f80865dd740 @(#) $OpenLDAP: slapd 2.6.3 (Jan 17 2023 16:44:38) $
	@a34c3898a374:/bitnami/blacksmith-sandox/openldap-2.6.3/servers/slapd
63ea2e44.12fcd0c6 0x7f80865dd740 slapd starting
 12:34:13.29 INFO  ==> Configure LDAP credentials for admin user
SASL/EXTERNAL authentication started
63ea2e45.129e9926 0x7f807ffff700 conn=1000 op=0 BIND dn="" method=163
63ea2e45.12a09616 0x7f807ffff700 conn=1000 op=0 BIND authcid="gidNumber=0+uidNumber=1001,cn=peercred,cn=external,cn=auth" authzid="gidNumber=0+uidNumber=1001,cn=peercred,cn=external,cn=auth"
63ea2e45.12a1a675 0x7f807ffff700 conn=1000 op=0 BIND dn="gidNumber=0+uidNumber=1001,cn=peercred,cn=external,cn=auth" mech=EXTERNAL bind_ssf=0 ssf=71
63ea2e45.12a2e2d4 0x7f807ffff700 conn=1000 op=0 RESULT tag=97 err=0 qtime=0.000031 etime=0.000334 text=
SASL username: gidNumber=0+uidNumber=1001,cn=peercred,cn=external,cn=auth
SASL SSF: 0
63ea2e45.12aa3962 0x7f8084e3b700 conn=1000 op=1 MOD dn="olcDatabase={2}mdb,cn=config"
63ea2e45.12ab9ed5 0x7f8084e3b700 conn=1000 op=1 MOD attr=olcSuffix
63ea2e45.12b75dc5 0x7f8084e3b700 conn=1000 op=1 RESULT tag=103 err=0 qtime=0.000021 etime=0.000949 text=
63ea2e45.12bafcdf 0x7f807ffff700 conn=1000 op=2 MOD dn="olcDatabase={2}mdb,cn=config"
63ea2e45.12bc1f9a 0x7f807ffff700 conn=1000 op=2 MOD attr=olcRootDN
63ea2e45.12d0d7d7 0x7f807ffff700 conn=1000 op=2 RESULT tag=103 err=0 qtime=0.000018 etime=0.001502 text=
63ea2e45.12d75542 0x7f8084e3b700 conn=1000 op=3 MOD dn="olcDatabase={2}mdb,cn=config"
63ea2e45.12d85261 0x7f8084e3b700 conn=1000 op=3 MOD attr=olcRootPW
63ea2e45.12e47b24 0x7f8084e3b700 conn=1000 op=3 RESULT tag=103 err=0 qtime=0.000020 etime=0.000913 text=
63ea2e45.12e8d06b 0x7f807ffff700 conn=1000 op=4 MOD dn="olcDatabase={1}monitor,cn=config"
63ea2e45.12ea7bb2 0x7f807ffff700 conn=1000 op=4 MOD attr=olcAccess
63ea2e45.12f6783f 0x7f807ffff700 conn=1000 op=4 RESULT tag=103 err=0 qtime=0.000023 etime=0.000957 text=
63ea2e45.12fd5077 0x7f8084e3b700 conn=1000 op=5 MOD dn="olcDatabase={0}config,cn=config"
63ea2e45.12fe3ca5 0x7f8084e3b700 conn=1000 op=5 MOD attr=olcRootDN
63ea2e45.1309da0e 0x7f8084e3b700 conn=1000 op=5 RESULT tag=103 err=0 qtime=0.000022 etime=0.000877 text=
63ea2e45.130fb4de 0x7f807ffff700 conn=1000 op=6 MOD dn="olcDatabase={0}config,cn=config"
63ea2e45.1311528f 0x7f807ffff700 conn=1000 op=6 MOD attr=olcRootPW
63ea2e45.131c6f64 0x7f807ffff700 conn=1000 op=6 RESULT tag=103 err=0 qtime=0.000045 etime=0.000918 text=
63ea2e45.1322158d 0x7f8084e3b700 conn=1000 op=7 UNBIND
modifying entry "olcDatabase={2}mdb,cn=config"

modifying entry "olcDatabase={2}mdb,cn=config"

modifying entry "olcDatabase={2}mdb,cn=config"

modifying entry "olcDatabase={1}monitor,cn=config"

modifying entry "olcDatabase={0}config,cn=config"

modifying entry "olcDatabase={0}config,cn=config"

63ea2e45.1323f0d7 0x7f8084e3b700 conn=1000 fd=12 closed
 12:34:13.32 INFO  ==> Configuring TLS
SASL/EXTERNAL authentication started
63ea2e45.13e5ff6d 0x7f8084e3b700 conn=1001 op=0 BIND dn="" method=163
63ea2e45.13e717b9 0x7f8084e3b700 conn=1001 op=0 BIND authcid="gidNumber=0+uidNumber=1001,cn=peercred,cn=external,cn=auth" authzid="gidNumber=0+uidNumber=1001,cn=peercred,cn=external,cn=auth"
63ea2e45.13e7a3dc 0x7f8084e3b700 conn=1001 op=0 BIND dn="gidNumber=0+uidNumber=1001,cn=peercred,cn=external,cn=auth" mech=EXTERNAL bind_ssf=0 ssf=71
63ea2e45.13e89ee9 0x7f8084e3b700 conn=1001 op=0 RESULT tag=97 err=0 qtime=0.000016 etime=0.000196 text=
SASL username: gidNumber=0+uidNumber=1001,cn=peercred,cn=external,cn=auth
SASL SSF: 0
63ea2e45.13f1325f 0x7f807ffff700 conn=1001 op=1 MOD dn="cn=config"
63ea2e45.13f2ce6b 0x7f807ffff700 conn=1001 op=1 MOD attr=olcTLSCACertificateFile olcTLSCertificateFile olcTLSCertificateKeyFile
63ea2e45.141236af 0x7f807ffff700 conn=1001 op=1 RESULT tag=103 err=0 qtime=0.000023 etime=0.002223 text=
63ea2e45.14156b38 0x7f807ffff700 conn=1001 op=2 UNBIND
63ea2e45.14166e37 0x7f807ffff700 conn=1001 fd=12 closed
modifying entry "cn=config"

 12:34:13.34 INFO  ==> Adding LDAP extra schemas
SASL/EXTERNAL authentication started
63ea2e45.14f0eb92 0x7f807ffff700 conn=1002 op=0 BIND dn="" method=163
63ea2e45.14f25bc1 0x7f807ffff700 conn=1002 op=0 BIND authcid="gidNumber=0+uidNumber=1001,cn=peercred,cn=external,cn=auth" authzid="gidNumber=0+uidNumber=1001,cn=peercred,cn=external,cn=auth"
63ea2e45.14f2e0ef 0x7f807ffff700 conn=1002 op=0 BIND dn="gidNumber=0+uidNumber=1001,cn=peercred,cn=external,cn=auth" mech=EXTERNAL bind_ssf=0 ssf=71
63ea2e45.14f3cddd 0x7f807ffff700 conn=1002 op=0 RESULT tag=97 err=0 qtime=0.000017 etime=0.000213 text=
SASL username: gidNumber=0+uidNumber=1001,cn=peercred,cn=external,cn=auth
SASL SSF: 0
63ea2e45.14fc1b30 0x7f8084e3b700 conn=1002 op=1 ADD dn="cn=cosine,cn=schema,cn=config"
63ea2e45.1521614a 0x7f8084e3b700 conn=1002 op=1 RESULT tag=105 err=0 qtime=0.000015 etime=0.002529 text=
63ea2e45.1524ebdd 0x7f807ffff700 conn=1002 op=2 UNBIND
63ea2e45.15262d54 0x7f807ffff700 conn=1002 fd=12 closed
adding new entry "cn=cosine,cn=schema,cn=config"

SASL/EXTERNAL authentication started
63ea2e45.15a2881c 0x7f807ffff700 conn=1003 op=0 BIND dn="" method=163
63ea2e45.15a4292d 0x7f807ffff700 conn=1003 op=0 BIND authcid="gidNumber=0+uidNumber=1001,cn=peercred,cn=external,cn=auth" authzid="gidNumber=0+uidNumber=1001,cn=peercred,cn=external,cn=auth"
63ea2e45.15a4bf1c 0x7f807ffff700 conn=1003 op=0 BIND dn="gidNumber=0+uidNumber=1001,cn=peercred,cn=external,cn=auth" mech=EXTERNAL bind_ssf=0 ssf=71
63ea2e45.15a5a502 0x7f807ffff700 conn=1003 op=0 RESULT tag=97 err=0 qtime=0.000014 etime=0.000225 text=
SASL username: gidNumber=0+uidNumber=1001,cn=peercred,cn=external,cn=auth
SASL SSF: 0
63ea2e45.15ab3fda 0x7f8084e3b700 conn=1003 op=1 ADD dn="cn=inetorgperson,cn=schema,cn=config"
63ea2e45.15b9f628 0x7f8084e3b700 conn=1003 op=1 RESULT tag=105 err=0 qtime=0.000019 etime=0.001026 text=
63ea2e45.15be373f 0x7f807ffff700 conn=1003 op=2 UNBIND
adding new entry "cn=inetorgperson,cn=schema,cn=config"

63ea2e45.15c109ea 0x7f807ffff700 conn=1003 fd=12 closed
SASL/EXTERNAL authentication started
63ea2e45.16310d40 0x7f807ffff700 conn=1004 op=0 BIND dn="" method=163
63ea2e45.1632c754 0x7f807ffff700 conn=1004 op=0 BIND authcid="gidNumber=0+uidNumber=1001,cn=peercred,cn=external,cn=auth" authzid="gidNumber=0+uidNumber=1001,cn=peercred,cn=external,cn=auth"
63ea2e45.16335df1 0x7f807ffff700 conn=1004 op=0 BIND dn="gidNumber=0+uidNumber=1001,cn=peercred,cn=external,cn=auth" mech=EXTERNAL bind_ssf=0 ssf=71
63ea2e45.16343b1a 0x7f807ffff700 conn=1004 op=0 RESULT tag=97 err=0 qtime=0.000014 etime=0.000229 text=
SASL username: gidNumber=0+uidNumber=1001,cn=peercred,cn=external,cn=auth
SASL SSF: 0
63ea2e45.163b13cc 0x7f8084e3b700 conn=1004 op=1 ADD dn="cn=nis,cn=schema,cn=config"
63ea2e45.1653ad1f 0x7f8084e3b700 conn=1004 op=1 RESULT tag=105 err=0 qtime=0.000015 etime=0.001674 text=
63ea2e45.1658465c 0x7f807ffff700 conn=1004 op=2 UNBIND
63ea2e45.165a822e 0x7f807ffff700 conn=1004 fd=12 closed
adding new entry "cn=nis,cn=schema,cn=config"

 12:34:13.38 INFO  ==> Creating LDAP default tree
63ea2e45.18b9ca3b 0x7f807ffff700 conn=1005 op=0 BIND dn="cn=admin,dc=vn,dc=linuxguru,dc=net" method=128
63ea2e45.18bc1ba5 0x7f807ffff700 conn=1005 op=0 BIND dn="cn=admin,dc=vn,dc=linuxguru,dc=net" mech=SIMPLE bind_ssf=0 ssf=71
63ea2e45.18bfdd36 0x7f807ffff700 conn=1005 op=0 RESULT tag=97 err=0 qtime=0.000015 etime=0.000451 text=
63ea2e45.18c411d9 0x7f8084e3b700 conn=1005 op=1 ADD dn="dc=vn,dc=linuxguru,dc=net"
63ea2e45.18fc0451 0x7f8084e3b700 conn=1005 op=1 RESULT tag=105 err=0 qtime=0.000016 etime=0.003707 text=
63ea2e45.190141a3 0x7f807ffff700 conn=1005 op=2 ADD dn="ou=users,dc=vn,dc=linuxguru,dc=net"
63ea2e45.192bf1c3 0x7f807ffff700 conn=1005 op=2 RESULT tag=105 err=0 qtime=0.000018 etime=0.002847 text=
63ea2e45.1933f83e 0x7f8084e3b700 conn=1005 op=3 ADD dn="cn=user01,ou=users,dc=vn,dc=linuxguru,dc=net"
63ea2e45.195f3b02 0x7f8084e3b700 conn=1005 op=3 RESULT tag=105 err=0 qtime=0.000025 etime=0.002904 text=
63ea2e45.196460aa 0x7f807ffff700 conn=1005 op=4 ADD dn="cn=user02,ou=users,dc=vn,dc=linuxguru,dc=net"
63ea2e45.198e0629 0x7f807ffff700 conn=1005 op=4 RESULT tag=105 err=0 qtime=0.000023 etime=0.002796 text=
63ea2e45.1993573b 0x7f8084e3b700 conn=1005 op=5 ADD dn="cn=readers,ou=users,dc=vn,dc=linuxguru,dc=net"
63ea2e45.19be5e71 0x7f8084e3b700 conn=1005 op=5 RESULT tag=105 err=0 qtime=0.000024 etime=0.002879 text=
63ea2e45.19c3704c 0x7f807ffff700 conn=1005 op=6 UNBIND
63ea2e45.19c64200 0x7f807ffff700 conn=1005 fd=12 closed
adding new entry "dc=vn,dc=linuxguru,dc=net"

adding new entry "ou=users,dc=vn,dc=linuxguru,dc=net"

adding new entry "cn=user01,ou=users,dc=vn,dc=linuxguru,dc=net"

adding new entry "cn=user02,ou=users,dc=vn,dc=linuxguru,dc=net"

adding new entry "cn=readers,ou=users,dc=vn,dc=linuxguru,dc=net"

63ea2e45.1a76b531 0x7f808563c700 daemon: shutdown requested and initiated.
63ea2e45.1a7d44c2 0x7f808563c700 slapd shutdown: waiting for 0 operations/tasks to finish
63ea2e45.1a95633e 0x7f80865dd740 slapd stopped.
 12:34:14.46 INFO  ==> ** LDAP setup finished! **

 12:34:14.51 INFO  ==> ** Starting slapd **
63ea2e46.1fb278f3 0x7f30d458b740 @(#) $OpenLDAP: slapd 2.6.3 (Jan 17 2023 16:44:38) $
	@a34c3898a374:/bitnami/blacksmith-sandox/openldap-2.6.3/servers/slapd
63ea2e46.20db8e52 0x7f30d458b740 slapd starting
```




